Revit 2027 API
WallSweepInfo.IsFixed Property
 Indicates if the described wall sweep is fixed. A sweep is fixed if it is a part of a vertical compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFixed { get; }
Public ReadOnly Property IsFixed As Boolean
	Get
public:
property bool IsFixed {
	bool get ();
}
member IsFixed : bool with get
Property Value
Boolean
Remarks
 Wall sweeps from the definition of a vertical compound structure are fixed based on the wall type's definition. They are not permitted to be moved by users. Other wall sweeps defined outside of CompoundStructure by UI or API are permitted to be moved.
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace